Repository: yuri-schmaltz/addon-print3d-toolbox
Catalog: localization/*.po
Languages: es, ru_ru

source: Analyze
es: Analizar
ru_ru: Анализ

source: Checks
es: Comprobaciones
ru_ru: Проверки

source: Scale To
es: Escalar a
ru_ru: Масштабировать

source: Scene Scale
es: Escala de Escena
ru_ru: Масштаб сцены

source: Copy Textures
es: Copiar Texturas
ru_ru: Копировать текстуры

source: Volume: {}³
es: Volumen: {}³
ru_ru: Объём: {}³

source: Area: {}²
es: Área: {}²
ru_ru: Область: {}²

source: Non-manifold Edges: {}
es: Aristas No Desplegables: {}
ru_ru: Неразвёртываемые рёбра: {}

source: Bad Contiguous Edges: {}
es: Aristas Contiguas Incorrectas: {}
ru_ru: Прерывистые рёбра: {}

source: Intersect Face: {}
es: Caras Intersectadas: {}
ru_ru: Пересекающиеся грани: {}

source: Zero Faces: {}
es: Caras Nulas: {}
ru_ru: Нулевые грани: {}

source: Zero Edges: {}
es: Aristas Nulas: {}
ru_ru: Нулевые рёбра: {}

source: Non-flat Faces: {}
es: Caras No Planas: {}
ru_ru: Неплоские грани: {}

source: Thin Faces: {}
es: Caras Delgadas: {}
ru_ru: Тонкие грани: {}

source: Sharp Edge: {}
es: Aristas Definidas: {}
ru_ru: Острые рёбра: {}

source: Overhang Face: {}
es: Caras Sobresalientes: {}
ru_ru: Нависающие грани: {}

source: Report the volume of the active mesh
es: Informa del volumen de la malla activa
ru_ru: Показать объём активного мэша

source: Report the surface area of the active mesh
es: Informa del área de la superficie de la malla activa
ru_ru: Показать площадь поверхности активного мэша

source: Check for geometry is solid (has valid inside/outside) and correct normals
es: Comprobar que la geometría sea sólida (contenga un interior y exterior válidos) y sus normales correctas
ru_ru: Проверить, является ли геометрия сплошной (имеет допустимые внутренние и внешние границы) и корректные нормали

source: Check for self intersections
es: Comprobar intersecciones propias
ru_ru: Проверить на самопересечение

source: Check for zero area faces and zero length edges
es: Comprobar si hay caras de área cero y aristas de longitud cero
ru_ru: Проверить наличие граней нулевой площади и рёбер нулевой длины

source: Check for non-flat faces
es: Comprobar caras no planas
ru_ru: Проверить наличие неплоских граней

source: Check for wall thickness below specified value
es: Comprobar que el grosor de la pared no esté por debajo del valor especificado
ru_ru: Проверить наличие стенок тоньше указанного значения

source: Check for edges sharper than a specified angle
es: Comprobar si hay aristas más definidas que un ángulo especificado
ru_ru: Проверить наличие рёбер острее заданного угла

source: Check for faces that overhang past a specified angle
es: Comprobar si hay caras que sobresalen más allá de un ángulo específico
ru_ru: Проверить наличие нависающих граней за пределами заданного угла

source: Run all checks
es: Ejecutar todas las comprobaciones
ru_ru: Выполнить все проверки

source: Select the data associated with this report
es: Seleccionar los datos asociados con este informe
ru_ru: Выделить данные связанные с отчетом

source: Clear report
es: Limpiar informe
ru_ru: Очистить отчет

source: Cleanup loose geometry, interior faces, non-manifold vertices and inverted normals
es: Limpiar geometría suelta, caras interiores, vértices no múltiples y normales invertidas
ru_ru: Исправить несвязанную геометрию, внутренние грани, неразвёртываемые вершины и инвертированные нормали

source: Minimum Thickness
es: Grosor Mínimo
ru_ru: Минимальная Толщина

source: Export Directory
es: Directorio de Exportación
ru_ru: Каталог экспорта

source: Export file in ASCII format
es: Exportar archivo en formato ASCII
ru_ru: Экспортировать файл в формате ASCII

source: Apply scene scale on export
es: Aplicar escala de escena al exportar
ru_ru: Применить масштаб сцены при экспорте

source: Copy textures on export to the output path
es: Al exportar copia las texturas a la ruta de destino
ru_ru: Копировать текстуры при экспорте в экспортный каталог

source: Export selected objects using settings below
es: Exportar objetos seleccionados usando los ajustes de abajo
ru_ru: Экспортировать выделенные объекты, используя настройки ниже

source: Create offset surface
es: Crear superficie de desplazamiento
ru_ru: Создать поверхность с отступом

source: Offset direction relative to the object surface
es: Dirección de desplazamiento con respecto a la superficie del objeto
ru_ru: Направление отступа относительно поверхности объекта

source: Surface offset in relation to original mesh
es: Desplazamiento de la superficie en relación con la malla original
ru_ru: Отступ поверхности по отношению к исходному мэшу

source: Size of the voxel used for volume evaluation. Lower values preserve finer details
es: Tamaño del vóxel usado para la evaluación del volumen. Los valores más bajos conservan los detalles más finos
ru_ru: Размер вокселя, используемого для расчёта объема. Меньшие значения лучше сохраняют детализацию

source: Hollow Duplicate
es: Duplicado de Hueco
ru_ru: Дубликат с поднутрением

source: Create hollowed out copy of the object
es: Crear una copia ahuecada del objeto
ru_ru: Создать копию объекта с поднутрением

source: Rotate object so the selected faces lie, on average, parallel to the XY plane
es: Rotar el objeto de modo que las caras seleccionadas queden, en promedio, paralelas al plano XY
ru_ru: Повернуть объект так, чтобы выделенные грани лежали в среднем параллельно плоскости XY

source: Weight by Face Area
es: Peso por Área de Cara
ru_ru: Учитывать площадь грани

source: Take face area into account when calculating rotation
es: Tener en cuenta el área de la cara al calcular la rotación
ru_ru: Учитывать площадь грани при расчёте вращения

source: Multiple selected objects. Only the active one will be evaluated
es: Múltiples objetos seleccionados. Sólo el activo será evaluado
ru_ru: Несколько выделенных объектов. Только активный объект будет проверен

source: Report is out of date, re-run check
es: El informe ha caducado, volver a comprobar
ru_ru: Отчет устарел, проведите повторную проверку

source: Modified: {:+} vertices, {:+} edges, {:+} faces
es: Modificado: {:+} vértices, {:+} aristas, {:+} caras
ru_ru: Изменено: {:+} вершин, {:+} рёбер, {:+} граней

source: Make sure target mesh has closed surface and offset value is less than half of target thickness
es: Asegúrate de que la malla de destino tenga una superficie cerrada y que el valor de desplazamiento sea menor que la mitad del grosor del destino
ru_ru: Убедитесь, что целевой мэш имеет закрытую поверхность, а значение отступа меньше половины толщины целевой модели

source: Scaled by {}
es: Escalado por {}
ru_ru: Масштабирован на {}

source: , Clamping {}-Axis
es: , Eje {} de Limitación
ru_ru: , ограничение по оси {}

source: At least one mesh object must be selected
es: Se debe seleccionar al menos un objeto de malla
ru_ru: Должен быть выделен хотя бы один мэш объект

source: Object has zero volume
es: El objeto tiene un volumen nulo
ru_ru: Объект имеет нулевой объём

source: Object has zero bounds
es: El objeto tiene límites nulos
ru_ru: Объект имеет нулевые габариты

source: Exported: {!r}
es: Exportado: {!r}
ru_ru: Экспортировано: {!r}

source: Export failed
es: Exportación fallida
ru_ru: Экспорт не удался

# Operator
source: Volume
es: Volumen
ru_ru: Объём

# Operator
source: Area
es: Área
ru_ru: Область

# Operator
source: Solid
es: Sólido
ru_ru: Сплошная

# Operator
source: Intersections
es: Intersecciones
ru_ru: Пересечения

# Operator
source: Degenerate
es: Malformaciones
ru_ru: Дегенеративная

# Operator
source: Non-Planar
es: Cara No Plana
ru_ru: Непланарная

# Operator
source: Thickness
es: Grosor
ru_ru: Толщина

# Operator
source: Sharp
es: Definido
ru_ru: Острота

# Operator
source: Overhang
es: Sobresalientes
ru_ru: Нависание

# Operator
source: Check All
es: Comprobar Todo
ru_ru: Проверить всё

# Operator
source: Make Manifold
es: Hacer Desplegable
ru_ru: Сделать развёртываемой

# Operator
source: Hollow
es: Hueco
ru_ru: Поднутрение

# Operator
source: Align XY
es: Alinear XY
ru_ru: Выровнить XY

# Operator
source: Bounds
es: Límites
ru_ru: Габариты
